" set rtp+=C:\Users\artyu\AppData\Local\nvim\plugged\python-mode
" set nocompatible

" Settings used for brackets highlighting
" showmatch
" showmatch
" matchpairs
" matchtime


" Задаём в качестве рабочей оболочки командной строки Powershell.
" Сразу отваливается vim-plug
" set shell=powershell
" set shellcmdflag=-command


" Open help file on 'Shift + k' in vertical split
" Открыть файл помощи для слова под курсором в вертикальном окне
noremap <silent>  K   :execute "vert help ".expand("<cword>")<CR>
noremap <silent> <F1> :execute "vert help ".expand("<cword>")<CR>


" ================ Persistent Undo ==================
" Keep undo history across sessions, by storing in file.
" Only works all the time.
if has('persistent_undo') && isdirectory(expand('~').'/.vim/backups')
  silent !mkdir ~/.vim/backups > /dev/null 2>&1
  set undodir=~/.vim/backups
  set undofile
endif


" ================ Completion =======================
" stuff to ignore when tab completing
set wildignore=*.o,*.obj,*~
set wildignore+=*vim/backups*
set wildignore+=*sass-cache*
set wildignore+=*DS_Store*
set wildignore+=vendor/rails/**
set wildignore+=vendor/cache/**
set wildignore+=*.gem
set wildignore+=log/**
set wildignore+=tmp/**
set wildignore+=*.png,*.jpg,*.gif


" ================= Indentation ========================

" Auto indent pasted text
nnoremap p p=`]<C-o>
nnoremap P P=`]<C-o>

" ================= Basic Settings =====================

" Show the line and column number of the cursor position,
" separated by a comma.
set ruler
" показывать номера строк относительно текущей
set relativenumber

" set current working directory to the open file direcotry
set autochdir
autocmd BufEnter * silent! lcd %:p:h  " the same as autochdir

" ================= Key Bindings =======================

"аббревиатура: заменяет 'h' на 'vert h' в комманой строке
cabbrev h vert h
cnoreabbrev <expr> h getcmdtype() == ":" && getcmdline() == "h" ? "vert h" : "h"

inoremap jj <Esc>

" ================= Autocommands =======================

" A massively simplified take on https://github.com/chreekat/vim-paren-crosshairs
func! s:matchparen_cursorcolumn_setup()
  augroup matchparen_cursorcolumn
    autocmd!
    autocmd CursorMoved * if get(w:, "paren_hl_on", 0) | set cursorcolumn | else | set nocursorcolumn | endif
    autocmd InsertEnter * set nocursorcolumn
  augroup END
endf
if !&cursorcolumn
  augroup matchparen_cursorcolumn_setup
    autocmd!
    " - Add the event _only_ if matchparen is enabled.
    " - Event must be added _after_ matchparen loaded (so we can react to w:paren_hl_on).
    autocmd CursorMoved * if exists("#matchparen#CursorMoved") | call <sid>matchparen_cursorcolumn_setup() | endif
          \ | autocmd! matchparen_cursorcolumn_setup
  augroup END
endif

"           ██
"          ░░
"  ██    ██ ██ ██████████  ██████  █████
" ░██   ░██░██░░██░░██░░██░░██░░█ ██░░░██
" ░░██ ░██ ░██ ░██ ░██ ░██ ░██ ░ ░██  ░░
"  ░░████  ░██ ░██ ░██ ░██ ░██   ░██   ██
"   ░░██   ░██ ███ ░██ ░██░███   ░░█████
"    ░░    ░░ ░░░  ░░  ░░ ░░░     ░░░░░


"   ██           ██   ██                ██
"  ░░           ░░   ░██               ░░
"  ███  ██████   ██ ██████     ██    ██ ██ ██████████
" ░░██ ░██░░░██ ░██░░░██░     ░██   ░██░██░░██░░██░░██
"  ░██ ░██  ░██ ░██  ░██      ░░██ ░██ ░██ ░██ ░██ ░██
"  ░██ ░██  ░██ ░██  ░██       ░░████  ░██ ░██ ░██ ░██
"  ░██ ░██  ░██ ░██  ░░███  ██  ░░██   ░██ ███ ░██ ░██
"  ░░  ░░   ░░  ░░    ░░░  ░░    ░░    ░░ ░░░  ░░  ░░


"         ███                 ██
"        ░░██                ░░
"  ██████ ░██ ██   ██  ██████ ██ ██████   ██████
" ░██░░░██░██░██  ░██ ██░░░██░██░██░░░██ ██░░░░
" ░██  ░██░██░██  ░██░██  ░██░██░██  ░██░░█████
" ░██████ ░██░██  ░██░░██████░██░██  ░██ ░░░░░██
" ░██░░░  ░██░░█████  ░░░░░██░██░██  ░██ ██████
" ░██     ░░  ░░░░░    █████ ░░ ░░   ░░ ░░░░░░
" ░░                  ░░░░░


"                 ███                                    ██
"                ░░██                                   ░██
"   █████   █████ ░██  █████  ██████      ██████  █████ ░██████   █████  ██████████   █████
"  ██░░░██ ██░░░██░██ ██░░░██░░██░░█     ██░░░░  ██░░░██░██░░░██ ██░░░██░░██░░██░░██ ██░░░██
" ░██  ░░ ░██  ░██░██░██  ░██ ░██ ░     ░░█████ ░██  ░░ ░██  ░██░███████ ░██ ░██ ░██░███████
" ░██   ██░██  ░██░██░██  ░██ ░██        ░░░░░██░██   ██░██  ░██░██░░░░  ░██ ░██ ░██░██░░░░
" ░░█████ ░░█████ ░██░░█████ ░███        ██████ ░░█████ ░██  ░██░░█████  ███ ░██ ░██░░█████
"  ░░░░░   ░░░░░  ░░  ░░░░░  ░░░        ░░░░░░   ░░░░░  ░░   ░░  ░░░░░  ░░░  ░░  ░░  ░░░░░


"  ██                           ██      ██              ██ ██
" ░██                          ░██     ░░              ░██░░
" ░██   ██  █████  ██   ██     ░██████  ██ ██████   ██████ ██ ██████   ██████  ██████
" ░██  ██  ██░░░██░██  ░██     ░██░░░██░██░██░░░██ ██░░░██░██░██░░░██ ██░░░██ ██░░░░
" ░█████  ░███████░██  ░██     ░██  ░██░██░██  ░██░██  ░██░██░██  ░██░██  ░██░░█████
" ░██░░██ ░██░░░░ ░░██████     ░██  ░██░██░██  ░██░██  ░██░██░██  ░██░░██████ ░░░░░██
" ░██ ░░██░░█████  ░░░░░██     ░██████ ░██░██  ░██░░██████░██░██  ░██ ░░░░░██ ██████
" ░░   ░░  ░░░░░    █████      ░░░░░░  ░░ ░░   ░░  ░░░░░░ ░░ ░░   ░░   █████ ░░░░░░
"                  ░░░░░                                              ░░░░░


"  ████████
" ░████████
" ░████████
" ░████████
" ░████████
" ░░░░░░░░

"  ██      |          |       ██ |          |          |  ██      |  ██ |  ██      |  ███ |
" ░██      |          |      ░██ |          |          | ░██      | ░░  | ░██      | ░░██ |
" ░██████  |   █████  |   ██████ |   █████  |   ██████ | ░██████  |  ██ | ░██   ██ |  ░██ |
" ░██░░░██ |  ██░░░██ |  ██░░░██ |  ██░░░██ |  ██░░░██ | ░██░░░██ | ░██ | ░██  ██  |  ░██ |
" ░██  ░██ | ░██  ░░  | ░██  ░██ | ░███████ | ░██  ░██ | ░██  ░██ | ░██ | ░█████   |  ░██ |
" ░██  ░██ | ░██   ██ | ░██  ░██ | ░██░░░░  | ░░██████ | ░██  ░██ | ░██ | ░██░░██  |  ░██ |
" ░██████  | ░░█████  | ░░██████ | ░░█████  |  ░░░░░██ | ░██  ░██ | ░██ | ░██ ░░██ |  ░██ |
" ░░░░░░   |  ░░░░░   |  ░░░░░░  |  ░░░░░   |   █████  | ░░   ░░  | ░░  | ░░   ░░  |  ░░  |
"                                           |  ░░░░░   |
"
"              |          |          |          |         |          |    ██   |           |
"              |          |          |          |         |          |   ░██   |           |
"  ██████████  |  ██████  |   █████  |  ██████  |  ██████ |   ██████ |  ██████ |  ██    ██ |
" ░░██░░██░░██ | ░██░░░██ |  ██░░░██ | ░██░░░██ | ░░██░░█ |  ██░░░░  | ░░░██░  | ░██   ░██ |
"  ░██ ░██ ░██ | ░██  ░██ | ░██  ░██ | ░██  ░██ |  ░██ ░  | ░░█████  |   ░██   | ░░██ ░██  |
"  ░██ ░██ ░██ | ░██  ░██ | ░██  ░██ | ░██████  |  ░██    |  ░░░░░██ |   ░██   |  ░░████   |
"  ███ ░██ ░██ | ░██  ░██ | ░░█████  | ░██░░░   | ░███    |  ██████  |   ░░███ |   ░░██    |
" ░░░  ░░  ░░  | ░░   ░░  |  ░░░░░   | ░██      | ░░░     | ░░░░░░   |    ░░░  |    ░░     |
"                                    | ░░       |

"                                          .         .
" `8.`888b           ,8'  8 8888          ,8.       ,8.          8 888888888o.      ,o888888o.
"  `8.`888b         ,8'   8 8888         ,888.     ,888.         8 8888    `88.    8888     `88.
"   `8.`888b       ,8'    8 8888        .`8888.   .`8888.        8 8888     `88 ,8 8888       `8.
"    `8.`888b     ,8'     8 8888       ,8.`8888. ,8.`8888.       8 8888     ,88 88 8888
"     `8.`888b   ,8'      8 8888      ,8'8.`8888,8^8.`8888.      8 8888.   ,88' 88 8888
"      `8.`888b ,8'       8 8888     ,8' `8.`8888' `8.`8888.     8 888888888P'  88 8888
"       `8.`888b8'        8 8888    ,8'   `8.`88'   `8.`8888.    8 8888`8b      88 8888
"        `8.`888'         8 8888   ,8'     `8.`'     `8.`8888.   8 8888 `8b.    `8 8888       .8'
"         `8.`8'          8 8888  ,8'       `8        `8.`8888.  8 8888   `8b.     8888     ,88'
"          `8.`           8 8888 ,8'         `         `8.`8888. 8 8888     `88.    `8888888P'

         " d8b
         " Y8P
"
" 888  888 888 88888b.d88b.  888d888 .d8888b
" 888  888 888 888 '888 '88b 888P"  d88P"
" Y88  88P 888 888  888  888 888    888
"  Y8bd8P  888 888  888  888 888    Y88b.
"   Y88P   888 888  888  888 888     "Y8888P

                          "  iiii
                          " i::::i
                          "  iiii

" vvvvvvv           vvvvvvviiiiiii    mmmmmmm    mmmmmmm   rrrrr   rrrrrrrrr       cccccccccccccccc
"  v:::::v         v:::::v i:::::i  mm:::::::m  m:::::::mm r::::rrr:::::::::r    cc:::::::::::::::c
"   v:::::v       v:::::v   i::::i m::::::::::mm::::::::::mr:::::::::::::::::r  c:::::::::::::::::c
"    v:::::v     v:::::v    i::::i m::::::::::::::::::::::mrr::::::rrrrr::::::rc:::::::cccccc:::::c
"     v:::::v   v:::::v     i::::i m:::::mmm::::::mmm:::::m r:::::r     r:::::rc::::::c     ccccccc
"      v:::::v v:::::v      i::::i m::::m   m::::m   m::::m r:::::r     rrrrrrrc:::::c
"       v:::::v:::::v       i::::i m::::m   m::::m   m::::m r:::::r            c:::::c
"        v:::::::::v        i::::i m::::m   m::::m   m::::m r:::::r            c::::::c     ccccccc
"         v:::::::v        i::::::im::::m   m::::m   m::::m r:::::r            c:::::::cccccc:::::c
"          v:::::v         i::::::im::::m   m::::m   m::::m r:::::r             c:::::::::::::::::c
"           v:::v          i::::::im::::m   m::::m   m::::m r:::::r              cc:::::::::::::::c
"            vvv           iiiiiiiimmmmmm   mmmmmm   mmmmmm rrrrrrr                cccccccccccccccc

"        _
"       (_)
" __   ___ _ __ ___  _ __ ___
" \ \ / / | '_ ` _ \| '__/ __|
"  \ V /| | | | | | | | | (__
"   \_/ |_|_| |_| |_|_|  \___|

"                                ___           ___           ___
"       ___        ___          /__/\         /  /\         /  /\
"      /__/\      /  /\        |  |::\       /  /::\       /  /:/
"      \  \:\    /  /:/        |  |:|:\     /  /:/\:\     /  /:/
"       \  \:\  /__/::\      __|__|:|\:\   /  /:/~/:/    /  /:/  ___
"   ___  \__\:\ \__\/\:\__  /__/::::| \:\ /__/:/ /:/___ /__/:/  /  /\
"  /__/\ |  |:|    \  \:\/\ \  \:\~~\__\/ \  \:\/:::::/ \  \:\ /  /:/
"  \  \:\|  |:|     \__\::/  \  \:\        \  \::/~~~~   \  \:\  /:/
"   \  \:\__|:|     /__/:/    \  \:\        \  \:\        \  \:\/:/
"    \__\::::/      \__\/      \  \:\        \  \:\        \  \::/
"        ~~~~                   \__\/         \__\/         \__\/


" @@@  @@@  @@@  @@@@@@@@@@   @@@@@@@    @@@@@@@
" @@@  @@@  @@@  @@@@@@@@@@@  @@@@@@@@  @@@@@@@@
" @@!  @@@  @@!  @@! @@! @@!  @@!  @@@  !@@
" !@!  @!@  !@!  !@! !@! !@!  !@!  @!@  !@!
" @!@  !@!  !!@  @!! !!@ @!@  @!@!!@!   !@!
" !@!  !!!  !!!  !@!   ! !@!  !!@!@!    !!!
" :!:  !!:  !!:  !!:     !!:  !!: :!!   :!!
"  ::!!:!   :!:  :!:     :!:  :!:  !:!  :!:
"   ::::     ::  :::     ::   ::   :::   ::: :::
"    :      :     :      :     :   : :   :: :: :


" Univers
"              88
"              ''
"
" 8b       d8  88  88,dPYba,,adPYba,   8b,dPPYba,   ,adPPYba,
" `8b     d8'  88  88P'   '88'    '8a  88P'   'Y8  a8"     '"
"  `8b   d8'   88  88      88      88  88          8b
"   `8b,d8'    88  88      88      88  88          "8a,   ,aa
"     '8'      88  88      88      88  88           `"Ybbd8"'

